package ver2_lec04;

/**
 * 이너클래스 설명
 */
public class AnonyClassExplanation {

    /**
     *
     * 익명 클래스는 객체의 생성과 함께 클래스의 정의를 동시에 합니다.
     * 그래서 익명 클래스라고도 부릅니다.
     *
     * 익명 클래스는 내부 클래스 중에서 이름이 없이 함께 사용되는 것이라고 할 수 있습니다.
     *
     * 클래스는 중괄호, 즉 {, } 사이에 올 수 있으며,
     * 타입으로는 일반 클래스, 인터페이스, 추상 클래스가 올 수 있습니다.
     * 이렇다, 라고만 일단 알아두세요.
     *
     * 익명 클래스는 이럴 때 사용합니다.
     * 객체를 생성하려면 클래스를 정의한 후 사용해야 하지만,
     * 익명 클래스의 경우엔 1회성으로 사용하는 타입일 경우 사용하게 됩니다.
     *
     * 즉 1회성으로 즉시 클래스처럼 만들어서 사용하려면 익명 클래스를 만들어서 사용합니다.
     * 일종의 객체를 구현하는데 있어서 편리하기 때문입니다.
     * 일일이 클래스를 생성하고, 클래스의 내용을 정의하고,
     * 해당 클래스의 타입으로 객체를 생성하고, 생성된 객체를 사용하고의 단계를 거치지 않고,
     * 바로 익명 클래스를 통해서 클래스를 정의하고 객체를 생성해서 사용하는 단계를
     * 진행하는 것입니다.
     *
     * 익명 클래스에서 제네릭스를 사용할 수 있습니다.
     * 제네릭스는 <> 다이아몬드 표시를 붙여서 사용하는 것인데
     * 뒤에서 배우겠지만 일종의 자료형을 강제해 주는 것입니다.
     * 익명 클래스는 이를 사용할 수 있습니다.
     *
     * 이제 실습을 해보겠습니다.
     *
     */

}
