package ver2_lec04;

/**
 * 내부 클래스 설명
 */
public class InnerClassExplanation {

    /**
     * 내부 클래스는 클래스 내부에 다시 클래스를 정의한다고 할 수 있어요.
     * 즉 클래스 내에 다시 선언되는 클래스를 의미하죠.
     * 그렇기 때문에 내부 클래스와 내부 클래스가 선언된 외부 클래스는
     * 서로 긴밀한 관계에 있다고 할 수 있어요.
     * 내부 클래스를 선언했을 때는, 내부 클래스가 위치한 곳의
     * 외부 클래스의 멤버에 쉽게 접근이 가능하기 떄문이죠.
     * 그리고 외부 클래스를 가져다가 쓰는 곳에서는
     * 불필요한 클래스를 감출 수가 있어요. 이것을 일종의 캡슐화라고 하죠.
     * 다형성과 함께 객체지향의 특성을 이야기할 때 많이 이야기하는
     * 캡슐화라는 기법이예요.
     *
     * 단 이런 특징들은 또 다른 특징을 가지고 가죠.
     * 무엇이냐 하면 내부 클래스는 그 내부 클래스가 선언된 클래스 이외에는
     * 잘 사용되지 않는 것이어야만 합니다.
     * 내부 클래스가 선언된 클래스 이외에는 해당 내부 클래스를 쓰지 못하기 때문이죠.
     * 내부 클래스가 선언된 외부 클래스 전용의 클래스라고 보시면 됩니다.
     *
     * 그러면 실습에 들어가겠습니다.
     */

}
