package lec00;

/**
 * 두 번째 강의
 * JDK와 JRE 설명
 */
public class JDKandJRE02 {

    /**
     * JDK는 자바 개발도구라고 아시면 좋습니다.
     * JDK의 약자는 Java Development Kit이라고 부르죠.
     * 보통 자바 개발자에게 필요한 것은 JDK입니다.
     * JDK를 통해서 자바에서 제공되는 여러 기능을 사용하실 수 있습니다.
     *
     * Java는 여러가지의 API로 구성되어 있습니다.
     * API가 무엇이냐 하면 과거에는 일일이 사람이 구현해야 했던 기능들을
     * Java에서는 메서드를 사용해서 구현할 수 있도록 해줍니다.
     *
     * 아직 배우지 않은 것이지만 indexOf나 substring이나 하는 것들을 말합니다.
     *
     * 이런 메서드들을 사용하면 문자열에 대한 여러 가지 기능을 사용하실 수 있습니다.
     * 그 외에도 여러 메서드들을 사용해서 프로그래밍을 잘 할 수 있게 되지요.
     * 그런 것들을 하기 위해서,
     * 포괄적으로 말하자면 결국 자바 프로그래밍을 하기 위해서는
     * JDK가 필요하다는 것입니다.
     *
     * JRE는 자바 실행환경이라고 합니다.
     * Java Runtime Environment라고 부르죠.
     * JVM와 클래스 라이브러리로 구성되어 있습니다.
     * 클래스 라이브러리는 Java API라고 하죠.
     * Java API는 위에서 설명을 드렸습니다.
     * API는 Application Programming Interface라고 부르는 것입니다.
     * 응용 프로그래밍 인터페이스라고 부르죠.
     * 응용 프로그램에서 사용할 수 있도록 자바 프로그래밍 언어에서 제공한 기능을 제어할 수 있도록
     * 만들어 놓은 인터페이스입니다.
     * 개발자가 어떤 특정 기능을 좀 더 손쉽게 사용할 수 있도록 만들어 놓은 것을 말하죠.
     *
     * 보통 자바 프로그래밍 실습을 하기 위해서는 JDK만 있어도 됩니다.
     * Java로 만든 프로그램을 구동시키는데 있어서는 JRE가 필요하구요.
     * JDK를 설치하면 자바 프로그래밍을 하실 수 있게 됩니다.
     *
     * 그러므로 저희들은 실습을 위해 JDK를 설치하시고 실습을 하시면 되며,
     * 그래서 이전 강의에서 openjdk를 설치하였습니다.
     *
     * 감사합니다.
     */

}
