package ver2_lect05.fileIO05;

public class FileIO {

    /**
     * 파일 인풋, 아웃풋에 대해 설명 드리겠습니다.
     *
     * 프로그래밍은 과거에 데이터베이스를 쓰기 전에는 파일로 데이터들을 관리하던 시기가 있었다고 합니다.
     * 이 강의를 만드는 저자도 그런 시절을 겪어보진 못했습니다.
     * 파일로 데이터를 관리한다니, 저 역시 상상이 안 가는 시절입니다.
     * 하지만 과거에는 그러했다고 합니다.
     * 그때 파일 인풋, 아웃풋을 정말 많이 사용했었겠지요.
     *
     * 데이터베이스로 데이터를 관리하는 요즘 시대에는
     * 파일 인풋, 아웃풋은 엑셀 파일 다운로드, 업로드 등에서 많이 쓰입니다.
     * 거의 다 엑셀 파일이지요.
     * 나중에 이 강의를 들으시는 분들이 프로그래머가 안 된다 하시더라도
     * 어느 분야를 가서 일하시는 마이크로소프트의 오피스 프로그램은 매우 친숙해지실 겁니다.
     * 그 중에서도 엑셀은 정말 업무와 뗄래야 뗄 수 없는 프로그램이 되곤 합니다.
     * 그렇기 때문에 저자가 주로 일하는 업무용 소프트웨어 분야에서도
     * 엑셀로 데이터를 다운로드 받고 업로드하는 작업은 중시되곤 합니다.
     *
     * 그 외에도 파일 인풋, 아웃풋은 여러 곳에서 사용됩니다.
     * 그 중 하나는 통상적인 HTTP 통신을 통한 웹 프로그래밍이 아닐 경우에,
     * 데이터의 전송 및 수신에서도 파일 인풋, 아웃풋을 사용하곤 합니다.
     *
     * 이럴 경우에 쓰는 경우가 있기 때문에
     * 파일 인풋, 아웃풋은 알아두면 좋습니다.
     * 나중에 써야할 경우가 생기기 때문입니다.
     *
     * 그럼 실습에 들어가 보도록 하겠습니다.
     */

}
