package ver2_lec00;

public class CourseTableOfContents_02 {

    /**
     * 강의 구성을 소개해 드리려고 합니다.
     *
     * 저는 강의를 자바 8 이전 버전으로 초점을 맞추었어요.
     * 현재 강사는 자바 8의 기능도 사용이 가능하긴 하지만,
     * 자바 8이후부터 나온 기능들에 대해서는 이후에 제작할
     * 이론 편으로 다 미루어 두었어요.
     *
     * 일하시는 분야에 따라 다르겠지만, 현재는 실무에 나가시면
     * 자바 8 버전의 기능을 사용하시는 분들이 늘어나고 있는 추세이고,
     * 주류인 추세는 아닙니다.
     *
     * 자바 8에서 들어간 새로운 기능 중 대표적인 것은
     * 람다와 스트림이예요.
     * 람다와 스트림은 따로 배워야지만 사용이 가능한 기능이죠.
     * 그리고 그걸 입문 강의에서 사용만 해보고 쉽게 이해해 보는 수준이 아니라,
     * 이론을 곁들어서 깊게 설명을 드리려고 구상을 하다보니
     * 3번째 강의부터 제작할 자바 이론 강의로 미루어 두었어요.
     *
     * 현재 제작하는 2번째 강의, 자바 입문 2번쨰에서는 다루지
     * 않으려고 합니다.
     *
     * 람다와 스트림을 모르셔도 코드를 짜보고
     * 실습해 보시는데는 문제가 없어요.
     * 다만 나중에 실무에 나갔을 때는 모르시면 그걸 아는 개발자가
     * 람다와 스트림으로 짰을 때 따라가지 못할 확률이
     * 존재하게 됩니다.
     *
     * 그렇기 때문에 공부를 하셔야 해요.
     *
     * 그럼 자바 입문 두번째 강의의 구성을 설명해 드리겠습니다.
     *
     * 강의는
     * 추상클래스
     * 인터페이스
     * 내부클래스
     * 예외처리
     * 컬렉션 프레임워크
     * 제네릭스
     * 쓰레드
     * 입출력
     * 네트워킹
     * 으로 구성되어 있어요.
     *
     * 추상클래스, 인터페이스, 내부클래스는 객체지향에 속하는 개념입니다.
     * 깊게 다루진 않을 거예요.
     * 사용법을 아는 위주로 코드를 짜보면서 설명을 드릴 겁니다.
     *
     * 예외처리는 프로그램 구동 시 예외가 발생했을 때,
     * 프로그램임 무중단으로 동작하거나,
     * 예외를 잡아서 어떤 예외가 발생했는지,
     * 그리고 어떤 동작을 해야하는지 알려주는 개념이예요.
     * 그리고 컬렉션 프레임워크, 많이 말씀 드렸었죠.
     * 자료구조입니다.
     * 어떻게 효율적으로 자료를 처리할까에 대한 처리를 하는 것이예요.
     * 제네릭스는 자료에 담기는 자료형을 알려주는 기능이죠.
     * 컬렉션 프레임워크와 함께 꼭 알아두어야 하는 기능입니다.
     * 그리고 쓰레드는 병렬처리를 해줘야 할 때 써야 하는 기능이예요.
     * 쓰레드 프로그램을 통해 병렬 프로그램을 짤 수 있는 것이죠.
     * 병렬 프로그램의 대표적인 것은 채팅이라고도 할 수 있어요.
     * 병렬 프로그램은 주로 어떨 때 쓰냐면은
     * 여러 가지 작업을 동시에 처리해야 할 때 자주 쓰이는 기법입니다.
     * 하지만 병렬 프로그램은 동시에 작동되는 프로그램을
     * 통제하는 게 꽤나 까다로워요.
     * 그래서 동시에 작동되는 여러 프로그램이 안정적으로 동작할 수 있도록
     * 쓰레드를 잘 짜야 하기에 신입 분들이 경험하기 힘든 분야일 수도 있습니다.
     * 저는 쓰레드를 잘 짜는 것은 고급 기법 중 하나에 속한다고 생각하는
     * 사람이기 때문에 그래요.
     * 입출력은 파일에 대한 입출력 등 다양한 입출력 기법을 사용합니다.
     * 배워보시면 뭔지 아실 거예요.
     * 네트워킹은 네트워크 프로그램을 짜보는 것입니다.
     * 그를 통해 알 수 있어요.
     * 자바 네트워크 프로그램을 어떻게 짜는지.
     *
     * 강의 구성은 이렇게 되어 있습니다.
     *
     * 저는 역시나 입문 강의이기 때문에 이론을 깊게 다루진 않을 거예요.
     * 3부에 해당하는 강의부터 이론을 깊게 다뤄 볼 생각입니다.
     * 그전까지는 자바에 대해 얇게 아시고,
     * 맛을 느끼셨으면 합니다.
     *
     * 강의 소개는 여기까지 하겠습니다.
     *
     * 감사합니다.
     */

}
