package ver2_lec00;

public class TutorIntroduction_01 {

    /**
     * 안녕하세요, 이번에 자바 두 번째 강의로 돌아왔습니다.
     * 첫 번째 강의는 객체지향 기본 개념까지 했지요.
     *
     * 이번 강의는 그 이후를 다루려고 합니다.
     *
     * 이전에 강의 소개에서 말씀드린 바와 같이 저는 자바 웹 개발자입니다.
     * 현재 실무 경력 만 4년을 채워가고 있구요.
     * 한화그룹, 금호그룹, 중앙그룹, 현대중공업 그룹 등의 협력사에서
     * System Integration에서 경력을 쌓다가,
     * 이제는 서비스 기업에서 경력을 쌓아가고 있습니다.
     *
     * 저는 자바를 배울 때 고생을 많이 했어요.
     * 이해가 잘 되지 않아 책을 여러번 읽고,
     * 예제 코드를 여러번 반복해 가면서 쳐봤죠.
     * 당시 예제 코드를 여러번 반복해서 친 것도
     * 백문이 불여일타라는 개발자 커뮤니티에서의
     * 선배 개발자의 이야기를 듣고 그러기도 했구요.
     *
     * 그렇게 고생해서 공부한 덕분인지,
     * 자바 공부에 애를 먹는 사람들의 마음을 어느 정도 이해합니다.
     * 그 분들이 어떤 마음이실지 조금이나마 이해를 해요.
     *
     * 그래서 그 분들에게 도움이 될 강의를 만들고 있습니다.
     *
     * 저 역시 학교 다닐 적에 자바로 애를 먹다가
     * 한 강의에서 얇은 책으로 자바 공부를 했었어요.
     * 객체지향의 기본 개념까지 다루는 책이었죠.
     *
     * 그 책은 그림으로도 설명이 많이 나와 있고 쉬운 코드들로만
     * 되어 있는 책이었습니다.
     * 그 책으로 많은 도움을 얻었죠.
     * 정말 쉬운 내용이기에 정말 쉽게 이해가 되었고
     * 그 책을 바탕으로 두꺼운 책을 반복해서 읽어가며 자바에 대한
     * 개념을 잡아가고 익혀갈 수 있었습니다.
     *
     * 여러분들에게도 당시 저에게 그 얇은 책이 준 것과 같은
     * 도움을 줄 수 있었으면 좋겠습니다.
     *
     * 자바에 성공적으로 입문하고, 더 어려운 강의를 통해 날개를 달고
     * 위로 올라가실 수 있는 계기가 되었으면 합니다.
     *
     * 그럼 강사 소개는 여기까지 하겠습니다.
     *
     * 감사합니다.
     */

}
