package lec01;

public class MainMethod {

    public static void main(String[] args) {
        /**
         * 이 안은 메인 메서드 안입니다.
         * 최초 클래스를 생성하고 메인 메서드를 만들어서 동작시킵니다.
         *
         * 보통 자바 프로그래밍을 할 때는 응용 프로그래밍보다는 웹 프로그래밍을 할 때가 많습니다.
         * 자바 웹 프로그래밍에 관심을 가지시는 분들이 많이들 아시는 Spring framework를 이용해서 말이죠.
         *
         * Spring framework를 사용해서 코딩할 때는 시작점이 main method가 아닙니다.
         * Spring boot를 할 때는 main method가 시작점이 되긴 하지만 미묘하게 다른 점이 있습니다.
         *
         * 왜 이 먼 미래의 이야기까지 하냐면, 보통 자바를 배우시는 분들은
         * 응용 프로그래밍만 하기 위해서 배우시는 분들은 드뭅니다.
         * Java > Servlet/JSP > Spring framework, 이런 절차를 밟아서
         * Spring framework까지 배우시고 난 뒤에
         * Spring framework를 이용해서 웹 프로그래밍을 하시는 경우가 많습니다.
         *
         * 최초 자바를 배울 때는 변수, 조건문, 반복문, 배열, 클래스, 객체, 컬랙션 프레임워크,
         * 네트워크, 예외처리, 쓰레드 등을 배우며 main method에서 해당 내용들을 실습합니다.
         *
         * 이것들을 메인 메서드에서 실행하며 실습한 뒤에는
         * 해당 지식들을 활용하여 Sprnig framework에서 웹 프로그래밍을 하는데 사용하게 됩니다.
         *
         * 즉, 지금 main method를 사용하여 자바 프로그래밍을 하시지만,
         * 먼 훗날 웹 프로그래밍을 하실 때는 main method를 자주 접하시진 않으실 겁니다.
         *
         * 그렇다고 의아해 하지 마시기 바랍니다.
         * 그리고 지금 main method에 대해 알아두는 것은 자바의 기본기를 익히기 위함임을 알아주셨으면 좋겠습니다.
         *
         * 메인 메서드는 프로그램의 시작점이다, 이렇게 알고 계셨으면 좋겠습니다.
         *
         * 그리고 모든 클래스가 메인 메서드를 가질 필요는 없습니다.
         * 다만 하나의 자바 애플리케이션은 메인 메서드를 포함한 클래스가 하나는 있어야 합니다.
         */
    }

}
