package ver2_lect05.networking06.network02;

public class Complete {

    public static void main(String[] args) {

        /**
         * 이제 강의 마무리입니다.
         *
         * 네트워크에 대한 설명은 이 정도로 하겠습니다.
         * 자세한 강의는 이제 제가 이어서 만들 이론 강의에서 좀 더 상세하게 다루어 보겠습니다.
         * 이론 강의 제작에는 또 다시 많은 시일이 소요될 것 같네요.
         * 몇 달이 걸릴지는 모르겠습니다.
         *
         * 지금까지는 입문 강의였습니다.
         * 여러분들에게 자바 입문을 위해서 알려드린 내용들이었죠.
         * 기본서들이나 기타 자세한 강의에 비해서는 가볍게 다룬 내용들입니다.
         *
         * 저는 여러분들이 입문 강의를 통해서 자바에 한 발 내딛으실 수 있었으면 좋겠습니다.
         *
         * 이제 입문 강의 이후에는 자바 입문 이론 강의를 들고 오도록 하겠습니다.
         *
         * 이 강의를 나누는데 많은 고민을 하였습니다.
         * 입문 실습과 이론 강의를 어떻게 구성해야 할지를 말이죠.
         * 일단 처음 만든 것은 입문 실습을 구성하여 강의를 올렸습니다.
         * 그리고 입문 이론 강의를 만들어서 다시 한 묶음의 강의 세트로 올리도록 하겠습니다.
         *
         * 나중에 찾아올 입문 이론 강의도 많은 분들이 들어주시고,
         * 개발자, 기획자 또는 IT 연관 종사자로서 성공적으로 입문하시길 바라겠습니다.
         *
         * 그럼 입문 강의는 여기서 마치도록 하겠습니다.
         * 그동안 잘 따라와 주셔서 감사합니다.
         */

    }

}
