package ver2_lect05.generics02;

public class GenericsIs01 {

    /**
     * 제네릭스는 일종의 타입을 알려주는 것입니다.
     * 제네릭스는 여러 곳에서 많이 사용됩니다.
     * 그 중에서도 많이 사용되는 곳은 컬렉션 프레임워크입니다.
     *
     * 제네릭스에는 기본형을 사용할 수가 없습니다.
     * int, float 등을 사용할 수 없다는 뜻이지요.
     * 하지만 Wrapper는 사용이 가능합니다.
     *
     * Wrapper를 쉽게 설명해 드리겠습니다.
     * Wrapper는 기본형인 자료형들을 참조형 형태로 사용하는 것이라고 보면 됩니다.
     * 종류는
     * Byte, Short, Integer, Long, Float, Double, Character, Boolean 등이 있습니다.
     * 앞에 대문자로 시작하지요.
     * 앞에서 소문자로 시작하면 되질 않습니다.
     *
     * Wrapper 들은 제네릭스에서 자료형을 지정해 주는 형태를 띕니다.
     * 만약 제네릭스가 Integer를 사용하면 해당 컬렉션 프레임워크나
     * 기타 등등에는 int 타입만 들어 올 수 있게 되는 것입니다.
     *
     * 이제 실습을 해보겠습니다.
     */

}
