package lec01.variables03.first;

/**
 * 변수 강의 01
 */
public class Variables01 {

    public static void main(String[] args) {

        /**
         * 변수를 명명하고 값을 저장하는 방식을 실습하겠습니다.
         */
        int amount;
        amount = 1000;
        /**
         * 이와 같은 형식은 변수명에 값을 할당할 때 실제로 메모리의 저장공간에 저장됩니다.
         */

        /**
         * 변수의 명명과 동시에 값을 지정하는 방식을 실습하겠습니다.
         */
        int price = 2000;
        /**
         * 이와 같은 형식은 초기화라고도 부릅니다.
         */

        /**
         * 다른 형태의 변수 선언 방식을 해보겠습니다.
         */
        String buildingName, schoolCount, companyLocation;
        /**
         * 이런 형태의 변수 선언 방식도 있지만 잘 쓰이진 않습니다.
         */

        /**
         * 다른 것도 실습해 볼까요?
         */
        int fruitCount = 10, cashAmount = 1000, bookSeries = 3;
        /**
         * 이렇게 여러 개의 변수를 선언하면서 값을 지정해 주는 방식도 있습니다.
         * 마찬가지로 잘 안 쓰이는 방식입니다.
         *
         * 실제 프로그래밍을 할 때도 권장하는 방식이 아닙니다.
         * 이유는 가독성이 떨어지며 프로그래밍은 혼자하는 것이 아니기 때문입니다.
         */

        /**
         * 변수 1 강의는 여기까지 하겠습니다.
         *
         * 다음 강의에서 찾아뵙겠습니다.
         * 감사합니다.
         */

    }

}
